armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
/*
*********************************************************************************************************
*    函 数 名: h7_LoadAlgoFile
*    功能说明: 装载算法文件
*    形    参: file_path 算法文件路径，是相对路径
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_LoadAlgoFile(lua_State* L)
{
    // pg_load_algo_file(AlgoFile, AlgoRamAddr, AlgoRamSize)
    const char *data;
    size_t len = 0;

    g_AlgoRam.Valid = 0;
    
    if (lua_type(L, 1) == LUA_TSTRING)     /* 判断第1个参数 */
    {        
        data = luaL_checklstring(L, 1, &len); /* 1是参数的位置， len是string的长度 */   
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (lua_type(L, 2) == LUA_TNUMBER) /* 判断第2个参数 */
    {
        g_AlgoRam.Addr = luaL_checknumber(L, 2);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }    
    
    if (lua_type(L, 3) == LUA_TNUMBER) /* 判断第3个参数 */
    {
        g_AlgoRam.Size = luaL_checknumber(L, 3);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (lua_type(L, 4) == LUA_TNUMBER) /* 判断第4个参数 (一般不用）*/
    {
        g_tVar.SaveAlgoToCFile = luaL_checknumber(L, 4);
    }
    else
    {
        g_tVar.SaveAlgoToCFile = 0;
    }
    
    g_AlgoRam.Valid = 1;
    
    /* lua程序提供的路径是相对路径 */
    {
        if (data[0] == '0' && data[1] == ':')     /* 是绝对路径 */
        {
            if (ELF_ParseFile((char *)data) != 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
                return 1;
            }
        }
        else    /* 是相对路径 */ 
        {    
            char path[256];
            
            GetDirOfFileName(g_tProg.FilePath, path);   /* 从lua文件名、中获取目录 */
            
            if (strlen(path) + strlen(data) + 1 > sizeof(path))
            {
                printf("FLM file name is too long\r\n");
                lua_pushnumber(L, 0);    /* 路径过长出错 */
                return 1;                
            }
            
            strcat(path, "/");
            strcat(path, data);

            FixFileName(path);  /* 去掉路径中的..上级目录 */ 
            
            if (ELF_ParseFile((char *)path) != 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
                return 1;
            }            
        }    
    }
    
    lua_pushnumber(L, 1);    /*OK */
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7_ProgFile
*    功能说明: 开始编程，从文件读取数据。 
*    形    参: file_path 数据文件名称, 目标flash地址
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_ProgFile(lua_State* L)
{
    const char *file_name;
    size_t len = 0;
    uint32_t FlashAddr;
    uint32_t EndAddr;
    uint32_t CtrlByte;
	uint32_t FileIndex = 0;
    
    /*
        lua调用:
        pg_prog_file(TaskList[i + 1], TaskList[i + 2], EndAddress, TaskList[i + 3])
    */
    if (lua_type(L, 1) == LUA_TSTRING)      /* 判断第1个参数 */
    {        
        file_name = luaL_checklstring(L, 1, &len); /* 1是参数的位置， len是string的长度 */   
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (lua_type(L, 2) == LUA_TNUMBER)      /* 判断第2个参数 */
    {
        FlashAddr = luaL_checknumber(L, 2);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    } 

    if (lua_type(L, 3) == LUA_TNUMBER)      /* 判断第3个参数 - 结束地址 */
    {
        EndAddr = luaL_checknumber(L, 3);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    } 
    
    if (lua_type(L, 4) == LUA_TNUMBER)      /* 判断第4个参数 - 控制字节， bit0表示滚码是否在本次烧录中写入 */
    {
        CtrlByte = luaL_checknumber(L, 4);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }    

    if (lua_type(L, 5) == LUA_TNUMBER)      /* 判断第5个参数 - 文件序号 */
    {
        FileIndex = luaL_checknumber(L, 5);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }  
       
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {    
        if (PG_SWD_ProgFile((char *)file_name, FlashAddr, EndAddr, CtrlByte, FileIndex) == 0)
        {
            lua_pushnumber(L, 1);    /*OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (PG_SWIM_ProgFile((char *)file_name, FlashAddr, EndAddr, CtrlByte, FileIndex) == 0)
        {
            lua_pushnumber(L, 1);    /*OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }        
    }  
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }    
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7_reset
*    功能说明: 执行硬件复位
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
extern void MUL_swd_set_target_reset(uint8_t asserted);
#define NVIC_Addr    (0xe000e000)
static int h7_reset(lua_State* L)
{   
    uint32_t delay;
    
    
    if (lua_type(L, 1) == LUA_TNUMBER) /* 判断第1个参数 */
    {
        delay = luaL_checknumber(L, 1);       
    }
    else
    {
        delay = 20;     /* 没有形参，则用20ms */
    } 
    
    printf("hardware reset %dms\r\n", delay);
    
    /* 硬件复位 */
    if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
    {

        MUL_swd_set_target_reset(1);
        
        // Perform a soft reset
        {
            uint32_t val[4];
            
            MUL_swd_read_word(NVIC_AIRCR, val);

            swd_write_word(NVIC_AIRCR, VECTKEY | (val[0] & SCB_AIRCR_PRIGROUP_Msk) | SYSRESETREQ);
        }
        
        osDelay(delay);        
 
        MUL_swd_set_target_reset(0);
        osDelay(delay); 
    }
    else        
    {
        swd_set_target_reset(1);
        // Perform a soft reset
        {
            uint32_t val;
            
            swd_read_word(NVIC_AIRCR, &val);

