armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
/*
*********************************************************************************************************
*    函 数 名: h7_ProgBuf_OB
*    功能说明: 开始编程，从新参读入数据。 用于option bytes
*    形    参: Flash地址
*			   数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_ProgBuf_OB(lua_State* L)
{
    const char *str;
    uint8_t DataBuf[1024];
    uint8_t DataBuf2[1024];
    size_t DataLen = 0;   
    uint8_t AddrBuf[2048];  /* 选项字的地址表，大端模式 */
    size_t AddrLen = 0;

    if (lua_type(L, 1) == LUA_TSTRING)              /* 判断第1个参数 */
    {
        str = luaL_checklstring(L, 1, &AddrLen);    /* 1是参数的位置， len是string的长度 */ 
        AddrLen = AsciiToHex((char *)str, AddrBuf, sizeof(AddrBuf));
        
        if ((AddrLen % 2) != 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
            return 1;           
        }
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (lua_type(L, 2) == LUA_TSTRING)          /* 判断第12个参数 */
    {        
        str = luaL_checklstring(L, 2, &DataLen); /* 2是参数的位置， len是string的长度 */ 
        /* 将字符换转换为2进制数组 "FF 00 12 34"   -> 0xFF,0x00,0x12,0x34 */
        DataLen = AsciiToHex((char *)str, DataBuf, sizeof(DataBuf));            
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
        
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {
        uint32_t HeadAddress;
        uint32_t Address;
        uint16_t len = 0;
        uint8_t * pAddr = AddrBuf;
        uint8_t * pData = DataBuf;                    
        
        HeadAddress = BEBufToUint32(AddrBuf);   /* ARM编程OPTION BYTES只需要首地址 */
        while (AddrLen)
        {            
            Address = BEBufToUint32(pAddr); 
            pAddr += 4;               
            AddrLen -= 4;
                            
            if (Address == 0xFFFFFFFF)              /* 遇到0xFFFFFFFF,则插入前第1个数据取反的数据 */
            {
                if (len > 0)
                {
                    DataBuf2[len++] = ~DataBuf2[len - 1];
                }
            }
            else if (Address == 0xFFFFFFFE)          /* 遇到0xFFFFFFFE,则插入前第2个数据取反的数据 */
            {
                if (len >= 2)
                {
                    DataBuf2[len++] = ~DataBuf2[len - 2];
                }
            }
            else if (Address == 0xFFFFFFFD)          /* 遇到0xFFFFFFFD,则插入前第4个数据取反的数据 */
            {
                if (len >= 4)
                {
                    DataBuf2[len++] = ~DataBuf2[len - 4];
                }
            }             
            else
            {    
                DataBuf2[len++] = *pData++;                 
            }
        }
        
        if (PG_SWD_ProgBuf_OB(HeadAddress, DataBuf2, len) == 0)
        {    
            lua_pushnumber(L, 1);    /* OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (STM8_ProgramOptionBytes(AddrBuf, AddrLen, DataBuf, DataLen) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }    
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7_Read_OptionBytes
*    功能说明: 根据地址列表，读取 option bytes
*    形    参: Flash地址
*			   数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
#define MUL_BUF_STEP    (LUA_READ_LEN_MAX / 4)        /* s_lua_read_buf 平分4组存放结果 */
static int h7_Read_OptionBytes(lua_State* L)
{
    const char *str; 
    uint8_t AddrBuf[2048];  /* 选项字的地址表，大端模式 */
    size_t AddrLen = 0;
    uint8_t err = 0;
    uint16_t len = 0;
    uint8_t OneByteMode = 0;
    uint16_t offset = 0;
    uint8_t ByteBuf[4] = {0};   
    
    if (lua_type(L, 1) == LUA_TSTRING)              /* 判断第1个参数 */
    {
        str = luaL_checklstring(L, 1, &AddrLen);    /* 1是参数的位置， len是string的长度 */ 
        AddrLen = AsciiToHex((char *)str, AddrBuf, sizeof(AddrBuf));
        
        if ((AddrLen % 2) != 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
            return 1;           
        }
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    /* 如果有第2个参数，则返回1个字节 */
    if (lua_type(L, 2) == LUA_TNUMBER)      /* 判断第3个参数 */
    {
        offset = luaL_checknumber(L, 2);  
        OneByteMode = 1;    /* 单字节模式 */    
    }
    else
    {
        OneByteMode = 0;    /* 完整数据 */
    }    
        
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {
        uint32_t Address;
        uint32_t LastAddress;
        uint8_t * pAddr = AddrBuf;
        uint32_t TempAddr;
       
        while (AddrLen)
        {            
            Address = BEBufToUint32(pAddr); 
            pAddr += 4;               
            AddrLen -= 4;
                            
            if (Address == 0xFFFFFFFF)              /* 遇到0xFFFFFFFF,则插入一个取反的数据 */
            {
                TempAddr = LastAddress + 1;
            }
            else if (Address == 0xFFFFFFFE)         /* 遇到0xFFFFFFFE,则插入前第2个数据取反的数据 */
            {
                TempAddr = LastAddress + 1;
                LastAddress++;
            }
            else if (Address == 0xFFFFFFFD)         /* 遇到0xFFFFFFFD,则插入前第4个数据取反的数据 */
            {
                TempAddr = LastAddress + 4;
                LastAddress++;
            }            
            else
            {
                TempAddr = Address;               
                LastAddress = Address;               
            }

            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {    
                uint8_t buf[4];
                
                if (MUL_swd_read_memory(TempAddr, buf, 1) == 0)
                {
                    err = 1;
                    break;
                }                    
                s_lua_read_buf[0 * MUL_BUF_STEP + len] = buf[0];
                s_lua_read_buf[1 * MUL_BUF_STEP + len] = buf[1];
                s_lua_read_buf[2 * MUL_BUF_STEP + len] = buf[2];
                s_lua_read_buf[3 * MUL_BUF_STEP + len] = buf[3];

