armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
                if (OneByteMode == 1)   /* 单字节模式 */
                {
                    if (len == offset)
                    {
                        ByteBuf[0] = buf[0];
                        ByteBuf[1] = buf[1];
                        ByteBuf[2] = buf[2];
                        ByteBuf[3] = buf[3];
                    }
                }                
            }
            else    /* 单路模式 */
            {
                if (swd_read_memory(TempAddr, &s_lua_read_buf[len], 1) == 0)
                {
                    err = 1;
                    break;
                }
                
                if (OneByteMode == 1)   /* 单字节模式 */
                {
                    if (len == offset)
                    {
                        ByteBuf[0] = s_lua_read_buf[len];
                    }
                }
            }
            len++;            
        }      
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        uint32_t Address;
        uint32_t LastAddress;
        uint8_t * pAddr = AddrBuf;
        
        while (AddrLen)
        {            
            Address = BEBufToUint16(pAddr); 
            pAddr += 2;               
            AddrLen -= 2;
                            
            if (Address == 0xFFFF)          /* 遇到0xFFFFFFFF,则插入一个取反的数据 */
            {
                if (SWIM_ReadBuf(LastAddress + 1, &s_lua_read_buf[len], 1) == 0)
                {
                    err = 1;
                    break;
                }
            }
            else
            {
                if (SWIM_ReadBuf(Address, &s_lua_read_buf[len], 1) == 0)
                {
                    err = 1;
                    break;
                }
                LastAddress = Address;               
            }
                        
            if (OneByteMode == 1)   /* 单字节模式 */
            {
                if (len == offset)
                {
                    ByteBuf[0] = s_lua_read_buf[len];
                }
            }            
            len++;
        }        
    }
    else
    {
        err = 1;
    }
    
    if (err != 0)
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }
    else
    {
        lua_pushnumber(L, 1);    /* 成功 */
    }

    if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
    {
        if (OneByteMode == 1)   /* 单字节模式 */
        {       
            s_lua_read_buf[0] = ByteBuf[0];
            s_lua_read_buf[1] = ByteBuf[1];
            s_lua_read_buf[2] = ByteBuf[2];            
            s_lua_read_buf[3] = ByteBuf[3];                        
            
            lua_pushlstring(L, (char *)(s_lua_read_buf + 0 * 1), 1); 
            lua_pushlstring(L, (char *)(s_lua_read_buf + 1 * 1), 1); 
            lua_pushlstring(L, (char *)(s_lua_read_buf + 2 * 1), 1); 
            lua_pushlstring(L, (char *)(s_lua_read_buf + 3 * 1), 1);
        }
        else    /* 完整模式 */
        {
            lua_pushlstring(L, (char *)(s_lua_read_buf + 0 * MUL_BUF_STEP), len); 
            lua_pushlstring(L, (char *)(s_lua_read_buf + 1 * MUL_BUF_STEP), len); 
            lua_pushlstring(L, (char *)(s_lua_read_buf + 2 * MUL_BUF_STEP), len); 
            lua_pushlstring(L, (char *)(s_lua_read_buf + 3 * MUL_BUF_STEP), len);            
        }
        return 5;         
    }
    else
    {    
        if (OneByteMode == 1)   /* 单字节模式 */
        {
            s_lua_read_buf[0] = ByteBuf[0];
            lua_pushlstring(L, (char *)s_lua_read_buf, 1);
        }
        else    /* 完整模式 */
        {
            lua_pushlstring(L, (char *)s_lua_read_buf, len);
        }
        return 2;         
    }
   
}

/*
*********************************************************************************************************
*    函 数 名: h7_EraseChip
*    功能说明: 擦除全片，用于OPTION BYTES编程，去除读保护。
*    形    参: Flash地址
*			   数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_EraseChip(lua_State* L)
{
    uint32_t FlashAddr;     

    if (lua_type(L, 1) == LUA_TNUMBER)      /* 判断第1个参数 */
    {
        FlashAddr = luaL_checknumber(L, 1);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }

    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {       
        if (PG_SWD_EraseChip(FlashAddr) == 0)
        {    
            lua_pushnumber(L, 1);    /* OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (STM8_FLASH_EraseChip(FlashAddr) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }    
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7_EraseSector
*    功能说明: 擦除扇区
*    形    参: Flash地址
*			   数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_EraseSector(lua_State* L)
{
    uint32_t FlashAddr;     

    if (lua_type(L, 1) == LUA_TNUMBER)      /* 判断第1个参数 */
    {
        FlashAddr = luaL_checknumber(L, 1);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }

    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {       
        if (PG_SWD_EraseSector(FlashAddr) == 0)
        {    
            lua_pushnumber(L, 1);    /* OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (STM8_FLASH_EraseSector(FlashAddr) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }    
    return 1;    
}

